devdnl/dnx-rtos/src/system/drivers/spi/stm32fx/spi_lld.c
        /* enable peripheral */
        SET_BIT(SPI->CR1, SPI_CR1_SPE);
}

//==============================================================================
/**
 * @brief Function apply SPI device safe configuration
 *
 * @param major         SPI major number
 */
//==============================================================================
void _SPI_LLD__halt(u8_t major)
{
        SPI_TypeDef *SPI = SPI_HW[major].SPI;

        while (SPI->SR & SPI_SR_BSY);

        CLEAR_BIT(SPI->CR1, SPI_CR1_SPE);
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);
}

//==============================================================================
/**
 * @brief  Transceive data by using IRQs or DMA
 * @param  hdl          virtual SPI handler
 * @param  txbuf        source buffer (can be NULL for RX only)
 * @param  rxbuf        destination buffer (can be NULL for TX only)
 * @param  count        number of bytes to transfer
 * @return One of errno value
 */
//==============================================================================
int _SPI_LLD__transceive(struct SPI_slave *hdl, const u8_t *txbuf, u8_t *rxbuf, size_t count)
{
        int err = EIO;
        _SPI[hdl->major]->slave = hdl;

#if USE_DMA > 0
        bool dma_capable = true;

        if ((txbuf && !sys_is_mem_dma_capable(txbuf)) || (rxbuf && !sys_is_mem_dma_capable(rxbuf)) ) {
                dma_capable = false;
        }

        // try to send/receive buffers by using DMA
        if (SPI_HW[hdl->major].use_DMA && dma_capable) {
                // reserve TX stream
                u32_t dmadtx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                SPI_HW[hdl->major].DMA_tx_stream_pri);
                if (dmadtx == 0) {
                        dmadtx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                  SPI_HW[hdl->major].DMA_tx_stream_alt);
                }

                // reserve RX stream
                u32_t dmadrx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                SPI_HW[hdl->major].DMA_rx_stream_pri);
                if (dmadrx == 0) {
                        dmadrx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                  SPI_HW[hdl->major].DMA_rx_stream_alt);
                }

                // configure channels
                if (dmadtx && dmadrx) {
                        CLEAR_BIT(SPI_HW[hdl->major].SPI->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

                        _SPI[hdl->major]->flush_byte = hdl->config.flush_byte;
                        _SPI[hdl->major]->count      = count;

                        _DMA_DDI_config_t config_tx;
                        config_tx.arg      = NULL;
                        config_tx.callback = NULL;
                        config_tx.cb_next  = NULL;
                        config_tx.release  = true;
                        config_tx.NDT      = count;
                        config_tx.PA       = cast(u32_t, &SPI_HW[hdl->major].SPI->DR);
                        config_tx.IRQ_priority = __CPU_DEFAULT_IRQ_PRIORITY__;
#if defined(ARCH_stm32f1)
                        config_tx.MA       = cast(u32_t, txbuf ? txbuf : &_SPI[hdl->major]->flush_byte);
                        config_tx.CR       = (txbuf ? DMA_CCRx_MINC_ENABLE : DMA_CCRx_MINC_FIXED)
                                           | DMA_CCRx_DIR_M2P
                                           | DMA_CCRx_MSIZE_BYTE
                                           | DMA_CCRx_PSIZE_BYTE;

#elif defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
                        config_tx.MA[0]    = cast(u32_t, txbuf ? txbuf : &_SPI[hdl->major]->flush_byte);
                        config_tx.FC       = 0;
                        config_tx.CR       = DMA_SxCR_CHSEL_SEL(SPI_HW[hdl->major].DMA_channel)
                                           | (txbuf ? DMA_SxCR_MINC_ENABLE : DMA_SxCR_MINC_FIXED)
                                           | DMA_SxCR_DIR_M2P
                                           | DMA_SxCR_MSIZE_BYTE
                                           | DMA_SxCR_PSIZE_BYTE;
#endif

                        _DMA_DDI_config_t config_rx;
                        config_rx.arg      = hdl;
                        config_rx.callback = DMA_callback;
                        config_rx.cb_next  = NULL;
                        config_rx.release  = true;
                        config_rx.NDT      = count;
                        config_rx.PA       = cast(u32_t, &SPI_HW[hdl->major].SPI->DR);
                        config_rx.IRQ_priority = __CPU_DEFAULT_IRQ_PRIORITY__;
#if defined(ARCH_stm32f1)
                        config_rx.MA       = cast(u32_t, rxbuf ? rxbuf : &_SPI[hdl->major]->flush_byte);
                        config_rx.CR       = (rxbuf ? DMA_CCRx_MINC_ENABLE : DMA_CCRx_MINC_FIXED)
                                           | DMA_CCRx_DIR_P2M
                                           | DMA_CCRx_MSIZE_BYTE
                                           | DMA_CCRx_PSIZE_BYTE;
#elif defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
                        config_rx.MA[0]    = cast(u32_t, rxbuf ? rxbuf : &_SPI[hdl->major]->flush_byte);
                        config_rx.FC       = 0;
                        config_rx.CR       = DMA_SxCR_CHSEL_SEL(SPI_HW[hdl->major].DMA_channel)
                                           | (rxbuf ? DMA_SxCR_MINC_ENABLE : DMA_SxCR_MINC_FIXED)
                                           | DMA_SxCR_DIR_P2M
                                           | DMA_SxCR_MSIZE_BYTE
                                           | DMA_SxCR_PSIZE_BYTE;
#endif
                        err = _DMA_DDI_transfer(dmadrx, &config_rx);
                        if (!err) {
                                err = _DMA_DDI_transfer(dmadtx, &config_tx);
                                if (!err) {
                                        SET_BIT(SPI_HW[hdl->major].SPI->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

                                        err = sys_semaphore_wait(_SPI[hdl->major]->wait_irq_sem,
                                                                 _SPI_IRQ_WAIT_TIMEOUT);

                                        _DMA_DDI_release(dmadtx);
                                        _DMA_DDI_release(dmadrx);
                                }
                        }

